# 'brew tap'
tap "common-fate/granted"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
brew "ansible"
brew "awscli"
brew "bat"
brew "exa"
brew "gh"
brew "git"
brew "ngupg"
brew "granted"
brew "grep"
brew "helm"
brew "lastpass-cli"
brew "macvim"
brew "mas"
brew "mongosh"
brew "neovim"
brew "netcat"
brew "nvm"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "rbenv"
brew "rclone"
brew "redis"
brew "tfenv"
brew "tgenv"
brew "wget"
brew "zsh"
brew "zsh-completions"

# 'mas install'
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Yubico Authenticator", id: 1497506650

# 'brew install --cask'
cask "alfred"
cask "amazon-workspaces"
cask "authy"
cask "azure-data-studio"
cask "bartender"
cask "beyond-compare"
cask "brave-browser"
cask "captin"
cask "dash"
cask "docker"
cask "eqmac"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "hyper"
cask "iterm2"
cask "karabiner-elements"
cask "macvim"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "openvpn-connect"
cask "postman"
cask "pgadmin4"
cask "rectangle-pro"
cask "spotify"
cask "vscodium"
cask "zoom"