# 'brew tap'
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"

# 'brew install'
brew "bat"
brew "exa"
brew "gh"
brew "git"
brew "ngupg"
brew "grep"
brew "macvim"
brew "mas"
brew "neovim"
brew "netcat"
brew "rclone"
brew "wget"
brew "zsh"
brew "zsh-completions"

# 'mas install'
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Yubico Authenticator", id: 1497506650

# 'brew install --cask'
cask "alfred"
cask "bartender"
cask "beyond-compare"
cask "brave-browser"
cask "captin"
cask "chromium --no-quarantine"
cask "dash"
cask "docker"
cask "eqmac"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "hyper"
cask "iterm2"
cask "karabiner-elements"
cask "macvim"
cask "rectangle-pro"
cask "spotify"
cask "vscodium"
cask "zoom"